;
; Note: shader requires additional functionality:
;       Use native low precision
;
; shader debug name: e0e8185b3d230c97c2697adcb23b0dc3.pdb
; shader hash: e0e8185b3d230c97c2697adcb23b0dc3
;
; Buffer Definitions:
;
;
; Resource Bindings:
;
; Name                                 Type  Format         Dim      ID      HLSL Bind  Count
; ------------------------------ ---------- ------- ----------- ------- -------------- ------
;
target datalayout = "e-m:e-p:32:32-i1:32-i8:8-i16:16-i32:32-i64:64-f16:16-f32:32-f64:64-n8:16:32:64"
target triple = "dxil-ms-dx"

%0 = type { i32, i32, i32, i32 }
%___rpsl_node_info_struct = type <{ i32, i32, i32, i32, i32 }>
%___rpsl_entry_desc_struct = type <{ i32, i32, i32, i32, i8*, i8* }>
%___rpsl_type_info_struct = type <{ i8, i8, i8, i8, i32, i32, i32 }>
%___rpsl_params_info_struct = type <{ i32, i32, i32, i32, i32, i16, i16 }>
%___rpsl_shader_ref_struct = type <{ i32, i32, i32, i32 }>
%___rpsl_pipeline_info_struct = type <{ i32, i32, i32, i32 }>
%___rpsl_pipeline_field_info_struct = type <{ i32, i32, i32, i32, i32, i32, i32, i32 }>
%___rpsl_pipeline_res_binding_info_struct = type <{ i32, i32, i32, i32 }>

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "dxc(private) 1.7.0.3789 (rps-merge-dxc1_7_2212_squash, b8686eeb8)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !20, globals: !93)
!1 = !DIFile(filename: "rpsl_triangle.rpsl", directory: "")
!2 = !{}
!3 = !{!4, !6, !18}
!4 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !1, line: 165, baseType: !5)
!5 = !DIBasicType(name: "uint64_t", size: 64, align: 64, encoding: DW_ATE_unsigned)
!6 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4", file: !1, line: 7, baseType: !7)
!7 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 4>", file: !1, line: 7, size: 128, align: 32, elements: !8, templateParams: !14)
!8 = !{!9, !11, !12, !13}
!9 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !7, file: !1, line: 7, baseType: !10, size: 32, align: 32, flags: DIFlagPublic)
!10 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!11 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !7, file: !1, line: 7, baseType: !10, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!12 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !7, file: !1, line: 7, baseType: !10, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!13 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !7, file: !1, line: 7, baseType: !10, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!14 = !{!15, !16}
!15 = !DITemplateTypeParameter(name: "element", type: !10)
!16 = !DITemplateValueParameter(name: "element_count", type: !17, value: i32 4)
!17 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!18 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !1, line: 128, baseType: !19)
!19 = !DIBasicType(name: "uint16_t", size: 16, align: 16, encoding: DW_ATE_unsigned)
!20 = !{!21, !62, !77, !80, !84, !87}
!21 = !DISubprogram(name: "make_default_texture_view_from_desc", linkageName: "\01?make_default_texture_view_from_desc@@YA?AUtexture@@IUResourceDesc@@@Z", scope: !22, file: !22, line: 152, type: !23, isLocal: false, isDefinition: true, scopeLine: 153, flags: DIFlagPrototyped, isOptimized: false, function: void (%struct.texture*, i32, %struct.ResourceDesc*)* @"\01?make_default_texture_view_from_desc@@YA?AUtexture@@IUResourceDesc@@@Z")
!22 = !DIFile(filename: "./___rpsl_builtin_header_.rpsl", directory: "")
!23 = !DISubroutineType(types: !24)
!24 = !{!25, !50, !51}
!25 = !DICompositeType(tag: DW_TAG_structure_type, name: "texture", file: !1, size: 288, align: 32, elements: !26)
!26 = !{!27, !29, !30, !31, !32, !39, !40, !41, !44, !47}
!27 = !DIDerivedType(tag: DW_TAG_member, name: "Resource", scope: !25, file: !1, baseType: !28, size: 32, align: 32)
!28 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "ViewFormat", scope: !25, file: !1, baseType: !28, size: 32, align: 32, offset: 32)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "TemporalLayer", scope: !25, file: !1, baseType: !28, size: 32, align: 32, offset: 64)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "Flags", scope: !25, file: !1, baseType: !28, size: 32, align: 32, offset: 96)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "SubresourceRange", scope: !25, file: !1, baseType: !33, size: 96, align: 32, offset: 128)
!33 = !DICompositeType(tag: DW_TAG_structure_type, name: "SubresourceRange", file: !1, size: 96, align: 32, elements: !34)
!34 = !{!35, !36, !37, !38}
!35 = !DIDerivedType(tag: DW_TAG_member, name: "base_mip_level", scope: !33, file: !1, baseType: !19, size: 16, align: 16)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "mip_level_count", scope: !33, file: !1, baseType: !19, size: 16, align: 16, offset: 16)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "base_array_layer", scope: !33, file: !1, baseType: !28, size: 32, align: 32, offset: 32)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "array_layer_count", scope: !33, file: !1, baseType: !28, size: 32, align: 32, offset: 64)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "MinLodClamp", scope: !25, file: !1, baseType: !10, size: 32, align: 32, offset: 224)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "ComponentMapping", scope: !25, file: !1, baseType: !28, size: 32, align: 32, offset: 256)
!41 = !DISubprogram(name: "create1D", linkageName: "\01?create1D@texture@@SA?AU1@IIIIII@Z", scope: !25, file: !1, type: !42, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!42 = !DISubroutineType(types: !43)
!43 = !{!25, !28, !28, !28, !28, !28, !28}
!44 = !DISubprogram(name: "create2D", linkageName: "\01?create2D@texture@@SA?AU1@IIIIIIIII@Z", scope: !25, file: !1, type: !45, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!45 = !DISubroutineType(types: !46)
!46 = !{!25, !28, !28, !28, !28, !28, !28, !28, !28, !28}
!47 = !DISubprogram(name: "create3D", linkageName: "\01?create3D@texture@@SA?AU1@IIIIIII@Z", scope: !25, file: !1, type: !48, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!48 = !DISubroutineType(types: !49)
!49 = !{!25, !28, !28, !28, !28, !28, !28, !28}
!50 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint", file: !1, baseType: !28)
!51 = !DICompositeType(tag: DW_TAG_structure_type, name: "ResourceDesc", file: !1, size: 288, align: 32, elements: !52)
!52 = !{!53, !54, !55, !56, !57, !58, !59, !60, !61}
!53 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !51, file: !1, baseType: !28, size: 32, align: 32)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "TemporalLayers", scope: !51, file: !1, baseType: !28, size: 32, align: 32, offset: 32)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "Flags", scope: !51, file: !1, baseType: !28, size: 32, align: 32, offset: 64)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "Width", scope: !51, file: !1, baseType: !28, size: 32, align: 32, offset: 96)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "Height", scope: !51, file: !1, baseType: !28, size: 32, align: 32, offset: 128)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "DepthOrArraySize", scope: !51, file: !1, baseType: !28, size: 32, align: 32, offset: 160)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "MipLevels", scope: !51, file: !1, baseType: !28, size: 32, align: 32, offset: 192)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "Format", scope: !51, file: !1, baseType: !28, size: 32, align: 32, offset: 224)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "SampleCount", scope: !51, file: !1, baseType: !28, size: 32, align: 32, offset: 256)
!62 = !DISubprogram(name: "make_default_buffer_view_from_desc", linkageName: "\01?make_default_buffer_view_from_desc@@YA?AUbuffer@@IUResourceDesc@@@Z", scope: !22, file: !22, line: 161, type: !63, isLocal: false, isDefinition: true, scopeLine: 162, flags: DIFlagPrototyped, isOptimized: false)
!63 = !DISubroutineType(types: !64)
!64 = !{!65, !50, !51}
!65 = !DICompositeType(tag: DW_TAG_structure_type, name: "buffer", file: !1, line: 159, size: 320, align: 64, elements: !66)
!66 = !{!67, !68, !69, !70, !71, !72, !73, !74}
!67 = !DIDerivedType(tag: DW_TAG_member, name: "Resource", scope: !65, file: !1, line: 159, baseType: !28, size: 32, align: 32)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "ViewFormat", scope: !65, file: !1, line: 159, baseType: !28, size: 32, align: 32, offset: 32)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "TemporalLayer", scope: !65, file: !1, line: 159, baseType: !28, size: 32, align: 32, offset: 64)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "Flags", scope: !65, file: !1, line: 159, baseType: !28, size: 32, align: 32, offset: 96)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "Offset", scope: !65, file: !1, line: 159, baseType: !5, size: 64, align: 64, offset: 128)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "SizeInBytes", scope: !65, file: !1, line: 159, baseType: !5, size: 64, align: 64, offset: 192)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "Stride", scope: !65, file: !1, line: 159, baseType: !28, size: 32, align: 32, offset: 256)
!74 = !DISubprogram(name: "create", linkageName: "\01?create@buffer@@SA?AU1@_KII@Z", scope: !65, file: !1, line: 159, type: !75, isLocal: false, isDefinition: false, scopeLine: 159, flags: DIFlagPrototyped, isOptimized: false)
!75 = !DISubroutineType(types: !76)
!76 = !{!65, !5, !28, !28}
!77 = !DISubprogram(name: "main", linkageName: "\01?main@@YAXUtexture@@@Z", scope: !1, file: !1, line: 4, type: !78, isLocal: false, isDefinition: true, scopeLine: 5, flags: DIFlagPrototyped, isOptimized: false, function: void (%struct.texture*)* @rpsl_M_rpsl_triangle_Fn_main)
!78 = !DISubroutineType(types: !79)
!79 = !{null, !25}
!80 = !DISubprogram(name: "make_default_texture_view", linkageName: "\01?make_default_texture_view@@YA?AUtexture@@IIII@Z", scope: !22, file: !22, line: 119, type: !81, isLocal: false, isDefinition: true, scopeLine: 120, flags: DIFlagPrototyped, isOptimized: false)
!81 = !DISubroutineType(types: !82)
!82 = !{!25, !50, !83, !50, !50}
!83 = !DIDerivedType(tag: DW_TAG_typedef, name: "RPS_FORMAT", file: !1, line: 9, baseType: !28)
!84 = !DISubprogram(name: "make_default_buffer_view", linkageName: "\01?make_default_buffer_view@@YA?AUbuffer@@I_K@Z", scope: !22, file: !22, line: 137, type: !85, isLocal: false, isDefinition: true, scopeLine: 138, flags: DIFlagPrototyped, isOptimized: false)
!85 = !DISubroutineType(types: !86)
!86 = !{!65, !50, !4}
!87 = !DISubprogram(name: "clear", linkageName: "\01?clear@@YA?AUnodeidentifier@@Utexture@@V?$vector@M$03@@@Z", scope: !22, file: !22, line: 292, type: !88, isLocal: false, isDefinition: true, scopeLine: 293, flags: DIFlagPrototyped, isOptimized: false)
!88 = !DISubroutineType(types: !89)
!89 = !{!90, !25, !6}
!90 = !DICompositeType(tag: DW_TAG_structure_type, name: "nodeidentifier", file: !22, line: 2, size: 32, align: 32, elements: !91)
!91 = !{!92}
!92 = !DIDerivedType(tag: DW_TAG_member, name: "unused", scope: !90, file: !22, line: 2, baseType: !50, size: 32, align: 32)
!93 = !{!94, !96, !97}
!94 = !DIGlobalVariable(name: "RPS_RESOURCE_TEX3D", scope: !0, file: !1, line: 157, type: !95, isLocal: true, isDefinition: true, variable: i32 4)
!95 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !28)
!96 = !DIGlobalVariable(name: "RPS_FORMAT_UNKNOWN", scope: !0, file: !1, line: 124, type: !95, isLocal: true, isDefinition: true, variable: i32 0)
!97 = !DIGlobalVariable(name: "___rpsl_pso_tmp", scope: !0, file: !22, line: 361, type: !98, isLocal: true, isDefinition: true)
!98 = !DICompositeType(tag: DW_TAG_structure_type, name: "Pipeline", file: !1, line: 361, size: 32, align: 32, elements: !99)
!99 = !{!100}
!100 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !98, file: !1, line: 361, baseType: !17, size: 32, align: 32, flags: DIFlagPrivate)
!101 = !{i32 2, !"Dwarf Version", i32 4}
!102 = !{i32 2, !"Debug Info Version", i32 3}
!103 = !{!"dxc(private) 1.7.0.3789 (rps-merge-dxc1_7_2212_squash, b8686eeb8)"}
!104 = !{!"rpsl_triangle.rpsl", !"#include \22___rpsl_builtin_header_.rpsl\22\0Agraphics node Triangle([readwrite(rendertarget)] texture renderTarget : SV_Target0);\0D\0A\0D\0Aexport void main([readonly(present)] texture backbuffer)\0D\0A{\0D\0A    // clear and then render geometry to backbuffer\0D\0A    clear(backbuffer, float4(0.0, 0.2, 0.4, 1.0));\0D\0A    Triangle(backbuffer);\0D\0A}"}
